
insert into music_artist_table 
values 
(1, 'Филипп', 'Киркоров', 'Король эстрады'),
(2, 'Иманбек', 'Маратович', 'FILV'),
(3, 'Алла', 'Пугачева', 'Алла Пугачева'),
(4, 'Алексей', 'Крупов', 'ATL'),
(5, 'Азамат', 'Кудзаев', 'MiyaGi'),
(6, 'Travis', 'Scot', 'Travis Scot'),
(7, 'Алсу', 'Абрамова', 'Алсу'),
(8, 'Матвей', 'Мельников', 'Мот');
insert into kind_table 
values 
(1, 'Поп-музыка'),
(2, 'РЭП'),
(3, 'Электроная музыка');
insert into join_table_3 
values 
(1, 1),
(2, 3),
(3, 1),
(4, 2),
(5, 2),
(6, 2),
(7, 1),
(8, 2);
insert into music_artist_table 
values 
(9, 'Луи', 'Армстронг', 'Луи Армстронг'),
(10, 'Linkin Park', 'Linkin  Park', 'Linkin Park');
insert into kind_table 
values 
(4, 'Альтернативный рок'),
(5, 'Джаз');
insert into join_table_3 
values 
(9, 5),
(10, 4);
insert into music_album_table 
values
(1, 'Наизнанку', 2016),
(2, 'Singin Satchmo', 2018),
(3, 'Лимб', 2017),
(4, 'Meteora (Deluxe Edition)', 2003),
(5, 'Зеркало души', 1977),
(6, 'Приглашение на закат', 2009),
(7, 'Алсу', 1999),
(8, 'Hajime (Part. 1)', 2018),
(9, 'FILV', 2018);
insert into track_table
values
(1, 'Невераятно', 190, 1),
(2, 'Изюм', 227, 1),
(3, 'Муссоны', 274, 1),
(4, 'Маврикий', 236, 1),
(5, 'Суперзвезда', 174, 1),
(6, 'I Only Have Eyes For You', 274, 2),
(7, 'Sittin In The Sun', 236, 2),
(8, 'Chantez-Les Bas (Sing Em Low)', 174, 2),
(9, 'Танцуйте', 220, 3),
(10, 'Шаман', 195, 3),
(11, '1000', 274, 3),
(12, 'Майк', 236, 3),
(13, 'Архитектор', 185, 3),
(14, 'Гори ясно', 192, 3),
(15, 'В унисон', 140, 3),
(16, 'Nobody s Listening', 178, 4),
(17, 'Breaking the Habit', 196, 4),
(18, 'Numb', 187, 4),
(19, 'Foreword', 13, 4),
(20, 'Faint', 162, 4),
(21, 'Figure.09', 196, 4),
(22, 'Balenciaga', 154, 9),
(23, 'Бубен шамана', 374, 5),
(24, 'Без меня', 274, 6),
(25, 'Зимний сон', 278, 7),
(26, 'Лабиринты', 194, 8);
insert into join_table_4 
values 
(1, 1),
(2, 1),
(3, 1),
(4, 1),
(5, 1),
(1, 3),
(2, 3),
(3, 3),
(4, 3),
(5, 3),
(9, 3),
(10, 3),
(11, 3),
(12, 3),
(13, 3),
(14, 3),
(15, 3),
(23, 2),
(24, 2),
(25, 2),
(26, 2),
(6, 5),
(7, 5),
(8, 5);
insert into collection_table 
values
(1, 'РЭП музыка 2020', 2020),
(2, 'POP музыка хиты', 2018),
(3, 'РЭП музыка 2018', 2018),
(4, 'РЭП музыка 2021', 2021),
(5, 'Джаз хиты XX века', 2019),
(6, 'хиты Linkin Park', 2021),
(7, 'сборник альтернативного рока', 2020),
(8, 'mix music', 2020);
insert into join_table_1 
values 
(3, 5),
(3, 6),
(4, 3),
(5, 8),
(7, 7),
(8, 1),
(9, 2),
(10, 4);
insert into join_table_2 
values 
(8, 1),
(8, 2),
(8, 3),
(8, 4),
(8, 5),
(9, 6),
(9, 7),
(9, 8),
(4, 9),
(4, 10),
(4, 11),
(4, 12),
(4, 13),
(4, 14),
(4, 15),
(10, 16),
(10, 17),
(10, 18),
(10, 19),
(10, 20),
(10, 21),
(2, 22),
(3, 23),
(3, 24),
(7, 25),
(7, 26);



